In [2]:
import pandas as pd

In [3]:
titanic_survival = pd.read_csv("titanic_survival.csv")

In [4]:
titanic_survival.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Null value for age column

In [21]:
age = titanic_survival["age"]
age_is_null = pd.isnull(age)
age_is_null

0       False
1       False
2       False
3       False
4       False
        ...
1305     True
1306    False
1307    False
1308    False
1309     True
Name: age, Length: 1310, dtype: bool

In [22]:
age_null = age[age_is_null]
age_null_count = len(age_null)
print(f"There are {age_null_count} missing value in age column")

There are 264 missing value in age column

In [65]:
bool_good_ages = []

for i in age_is_null:
    if i == True:
        i = False
        bool_good_ages.append(i)
        
    else:
        i = True
        bool_good_ages.append(i)
good_ages = age[bool_good_ages]

In [73]:
mean_age = round(good_ages.mean())
print(f"The mean age (rounded up) in the titanic was : {mean_age} years old.")

The mean age (rounded up) in the titanic was : 30 years old.

In [74]:
good_ages_2 = titanic_survival["age"][age_is_null == False]
mean_age_2 = round(good_ages.mean())
print(f"The mean age in titanic was : {mean_age_2} years old.")

The mean age in titanic was : 30 years old.

In [76]:
mean_fare = titanic_survival["fare"].mean()
print(mean_fare)

33.29547928134572

Fare by class

In [102]:
fare_by_class = {}
passengers_classes = [1, 2, 3]

for i in passengers_classes:
    passengers = titanic_survival[titanic_survival["pclass"] == i]
    mean_fare = round(passengers["fare"].mean(), 2)
    
    fare_by_class[i] = mean_fare
    

    
for k,v in fare_by_class.items():
    print(f"""Class {k} : {v}""")

Class 1 : 87.51
Class 2 : 21.18
Class 3 : 13.3

Mean age per pclass

In [107]:
import numpy
passenger_age = titanic_survival.pivot_table(index="pclass", values="age", aggfunc=numpy.mean)
passenger_age

              age
pclass
1.0     39.159918
2.0     29.506705
3.0     24.816367

Survivor per class

In [111]:
survivor_per_class = titanic_survival.pivot_table(index="pclass", values="survived", aggfunc=numpy.sum)
survivor_per_class

        survived
pclass
1.0        200.0
2.0        119.0
3.0        181.0

In [112]:
mean_survivor_per_class = titanic_survival.pivot_table(index="pclass", values="survived")
mean_survivor_per_class

        survived
pclass
1.0     0.619195
2.0     0.429603
3.0     0.255289

In [117]:
mean_port_stats = titanic_survival.pivot_table(index="embarked", values=["fare", "survived"], aggfunc=numpy.mean)
mean_port_stats

               fare  survived
embarked
C         62.336267  0.555556
Q         12.409012  0.357724
S         27.418824  0.332604

In [115]:
sum_port_stats = titanic_survival.pivot_table(index="embarked", values=["fare", "survived"], aggfunc=numpy.sum)
sum_port_stats

                fare  survived
embarked
C         16830.7922     150.0
Q          1526.3085      44.0
S         25033.3862     304.0

In [124]:
c = 0
q = 0
s = 0

for port in titanic_survival["embarked"]:
    if port == "C":
        c += 1
    elif port == "Q":
        q += 1
    elif port == "S":
        s += 1

print("Number of passenger per port")
print(f" C : {c}, Q : {q}, S : {s}")

Number of passenger per port
 C : 270, Q : 123, S : 914

Drop null values on age and sex columns

In [136]:
new_titanic_survival = titanic_survival.dropna(axis=0, subset=["age", "sex"])
new_titanic_survival.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [135]:
size_df_1 = titanic_survival.shape
size_df_2 = new_titanic_survival.shape
print(f"Size 1 : {size_df_1} || Size 2 : {size_df_2}")

Size 1 : (1310, 14) || Size 2 : (1046, 14)

In [145]:
first_ten_rows = new_titanic_survival.iloc[:10]
first_ten_rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1.0,1.0,"Anderson, Mr. Harry",male,48.0000,0.0,0.0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1.0,1.0,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1.0,0.0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1.0,0.0,"Andrews, Mr. Thomas Jr",male,39.0000,0.0,0.0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1.0,1.0,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2.0,0.0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1.0,0.0,"Artagaveytia, Mr. Ramon",male,71.0000,0.0,0.0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

In [141]:
row_position_fifth = new_titanic_survival.iloc[4]
row_position_fifth

pclass                                                     1
survived                                                   0
name         Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
sex                                                   female
age                                                       25
sibsp                                                      1
parch                                                      2
ticket                                                113781
fare                                                  151.55
cabin                                                C22 C26
embarked                                                   S
boat                                                     NaN
body                                                     NaN
home.dest                    Montreal, PQ / Chesterville, ON
Name: 4, dtype: object

In [143]:
row_index_25 = new_titanic_survival.loc[25]
row_index_25

pclass                         1
survived                       0
name         Birnbaum, Mr. Jakob
sex                         male
age                           25
sibsp                          0
parch                          0
ticket                     13905
fare                          26
cabin                        NaN
embarked                       C
boat                         NaN
body                         148
home.dest      San Francisco, CA
Name: 25, dtype: object

In [146]:
row_index_1100_age = new_titanic_survival.loc[1100, "age"]
row_index_25_survived = new_titanic_survival.loc[25,"survived"]
five_rows_three_columns = new_titanic_survival.iloc[:5, :3]

In [147]:
row_index_1100_age

29.0

In [148]:
row_index_25_survived

0.0

In [149]:
five_rows_three_columns

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

In [158]:
titanic_reindex = new_titanic_survival.reset_index(drop=True)
titanic_reindex.iloc[:5, :3]

   pclass  survived                                             name
0     1.0       1.0                    Allen, Miss. Elisabeth Walton
1     1.0       1.0                   Allison, Master. Hudson Trevor
2     1.0       0.0                     Allison, Miss. Helen Loraine
3     1.0       0.0             Allison, Mr. Hudson Joshua Creighton
4     1.0       0.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)

In [175]:
def count_null(column):
    column_null = column.isnull()
    null_count = len(column[column_null])
    return null_count

In [182]:
column_null_count = titanic_survival.apply(count_null)
column_null_count

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [189]:
def adult_or_minor(row):
    age = row["age"]
    if age < 18:
        return "Minor"
    elif age >= 18:
        return "Adult"
    else:
        return "Unkown"

In [190]:
age_labels = titanic_survival.apply(adult_or_minor, axis=1)
age_labels

0        Adult
1        Minor
2        Minor
3        Adult
4        Adult
         ...
1305    Unkown
1306     Adult
1307     Adult
1308     Adult
1309    Unkown
Length: 1310, dtype: object

In [198]:
titanic_survival["age label"] = age_labels

In [199]:
titanic_survival.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,age label
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",Adult
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",Minor
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Minor
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",Adult
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",Adult

In [204]:
age_group_survival = titanic_survival.pivot_table(index="age label", values="survived", aggfunc=numpy.mean)

In [205]:
age_group_survival

           survived
age label
Adult      0.387892
Minor      0.525974
Unkown     0.277567